Config/Documents/ЗаданиеНаЭкспортДанныхВБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаЭкспортДанныхВБанкиКС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Вид обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЕдиногоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект экспорта</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветWebСервиса</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроизвольныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/НастройкиОбменаБанкиКСПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаБанкиКСПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособыВыгрузкиФайловПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыВыгрузкиФайловПередачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ЗаданиеНаИмпортДанныхБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаИмпортДанныхБанкиКС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияОбменаБанкиКС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Comment>Дата окончания периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Comment>Дата начала периода выборки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Comment>Вид обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Объект экспорта</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Comment>Формат выгрузки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загрузить</Name>
							<Comment>Выбрать файл для дальнейшей загрузки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ЗаданиеНаЭкспортДанныхВБанкиКС/Forms/ФормаДокумента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////
// Переменные, необходимые для использования внешней обработки

&НаКлиенте
Перем ПараметрыОбработчика;

&НаКлиенте
Перем ВыполняемаяКоманда;

&НаКлиенте
Перем ПутьКПрограмме;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект, "СформироватьФайлы"
																			+",ОтправитьФайлы"
																			+",ЗагрузитьОтвет"
																			+",Заполнить"
																			+",УстановитьПериод");	 
	
	Если Параметры.Ключ.Пустая() Тогда //Новый документ
		Если Параметры.ЗначениеКопирования.Пустая() Тогда
			ЗаполнитьЗначенияСвойств(Объект, ПолучитьНастройкиОбменаПоУмолчанию(Объект.Организация));
			Если Объект.НастройкаОбмена.СпособОбмена = Перечисления.СпособыВыгрузкиФайловПередачи.Каталог Тогда 
				Объект.КаталогВыгрузки = Объект.НастройкаОбмена.ПутьВыгрузкиПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
		Объект.ДатаНач 	= НачалоДня(ТекущаяДатаСеанса());
		Объект.ДатаКон 	= КонецДня(ТекущаяДатаСеанса());
		Объект.Дата 	= ТекущаяДатаСеанса();
	КонецЕсли;	
		
	Команда 			= ЭтаФорма.Команды.Добавить("ПерейтиКФормеФайла");
	Команда.Действие 	= "Подключаемый_ПерейтиКФормеФайла";
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Файлы, "ВладелецФайла", Объект.Ссылка);
	
	ЦветПоясняющейНадписи = ЦветаСтиля.ПоясняющийТекст;
	ЦветОшибки = ЦветаСтиля.ПоясняющийОшибкуТекст;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
		
	Если Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая() Тогда //Новый документ
		ВыполнитьДействияНаСервере(Истина);
	Иначе
		ВыполнитьДействияНаСервере(Ложь);
	КонецЕсли;
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом   
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписи();	
	ОпределитьВидимостьКоманд();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = ЭтаФорма Тогда
		Если ИмяСобытия = "ВыбранаНастройкаОбменаБанкиКС" Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметр);
			ОбновитьНадписи();
			ПроверитьОбъектыОбмена();
			
			ВыполнитьДействияНаСервере(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения   
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрокаТЧ Из ТекущийОбъект.ПроизвольныеПараметры Цикл
		Значение = "";
		Если ПараметрыЗаписи.Свойство("ПолеТЧ"+СтрокаТЧ.НомерСтроки,Значение) Тогда
			СтрокаТЧ.Значение = Значение;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого ДопЭлемент Из Элементы.ПараметрыИмениФайла.ПодчиненныеЭлементы Цикл
		ПараметрыЗаписи.Вставить(Сред(ДопЭлемент.Имя,5),ЭтаФорма[Сред(ДопЭлемент.Имя,5)]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)       
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Оповестить("Запись_ЗаданиеНаЭкспортДанныхВБанкиКС", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОбменаПриИзменении(Элемент)
	
	Массив = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
		ТипКО = ТипКассовогоОрганаВидаОбмена(Объект.ВидОбмена);
	Иначе
		ТипКО = "";
		Объект.КассовыйОрган = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипКО) Тогда
		Массив.Добавить(Тип(ТипКО));
	Иначе
		Массив.Добавить(Тип("СправочникСсылка.Банки"));
		Массив.Добавить(Тип("СправочникСсылка.Казначейства"));
	КонецЕсли;
	
	ОписаниеТипов  	               = Новый ОписаниеТипов(Массив);
	Объект.КассовыйОрган           = ОписаниеТипов.ПривестиЗначение(Объект.КассовыйОрган);
	
	Элементы.КассовыйОрган.ДоступныеТипы   = ОписаниеТипов;
	Элементы.КассовыйОрган.ОграничениеТипа = ОписаниеТипов; 
	
	#Если ВебКлиент Тогда
	//выгрузка файлов нужна только для уфэбс и без веба
	Элементы.Подписать.Видимость            = Ложь;
	Элементы.Подписать.Доступность          = Ложь;	 
	
	Элементы.ЗаполнитьФайлами.Видимость     = Ложь;  
	Элементы.ЗаполнитьФайлами.Доступность   = Ложь; 
	
	//настройка видимости элементов табличной части
	Элементы.ОбъектыОбменаОбъект.Видимость   = Истина;
	Элементы.ОбъектыОбменаОбъект.Доступность = Истина;
	
	Элементы.ОбъектыОбменаФайл.Видимость     = Ложь;
	Элементы.ОбъектыОбменаФайл.Доступность   = Ложь;
	
	#Иначе
	ТекНомерВерсии = ПредставлениеВНомереВерссии();
	Элементы.Подписать.Видимость             = ?(ТекНомерВерсии = "UFBS", Истина, Ложь);
	Элементы.Подписать.Доступность           = ?(ТекНомерВерсии = "UFBS", Истина, Ложь);  
	
	Элементы.ЗаполнитьФайлами.Видимость      = ?(ТекНомерВерсии = "UFBS", Истина, Ложь);  
	Элементы.ЗаполнитьФайлами.Доступность    = ?(ТекНомерВерсии = "UFBS", Истина, Ложь); 
	
	ВидимостьФайла                           = Ложь;
	
	Если ТекНомерВерсии = "UFBS" И Объект.ОбъектыОбмена.Количество()>0 Тогда
		Если ЗначениеЗаполнено(Объект.ОбъектыОбмена[0].Файл) Тогда    
			 ВидимостьФайла                  = Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	//настройка видимости элементов табличной части
	Элементы.ОбъектыОбменаОбъект.Видимость   = НЕ ВидимостьФайла;
	Элементы.ОбъектыОбменаОбъект.Доступность = НЕ ВидимостьФайла;
	
	Элементы.ОбъектыОбменаФайл.Видимость     = ВидимостьФайла;
	Элементы.ОбъектыОбменаФайл.Доступность   = ВидимостьФайла;
	
	#КонецЕсли

	Объект.ОбъектыОбмена.Очистить();
	
	ВыполнитьДействияНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОбменаПриИзменении(Элемент)
	
	ВыполнитьДействияНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбУстановкеРасширенияРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение,, Истина);
	
	//Если ОбщегоНазначенияКлиент.ПредложитьУстановкуРасширенияРаботыСФайлами() = "Подключено" Тогда				
	//	СтандартнаяОбработка = Ложь;
	//	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	//	ДиалогВыбора.Каталог = Объект.КаталогВыгрузки;
	//	Если ДиалогВыбора.Выбрать() Тогда
	//		Объект.КаталогВыгрузки = ДиалогВыбора.Каталог;
	//		ЭтаФорма.Модифицированность = Истина;
	//	КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУстановкеРасширенияРаботыСФайлами(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	Если РасширениеПодключено Тогда
		СтандартнаяОбработка = Ложь;
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогВыбора.Каталог = Объект.КаталогВыгрузки;
		ДиалогВыбора.Показать(Новый ОписаниеОповещения("ПослеВопросаОбУстановкеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбора", ДиалогВыбора)));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбУстановкеРасширенияРаботыСФайламиЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ДиалогВыбора = ДополнительныеПараметры.ДиалогВыбора;
		Объект.КаталогВыгрузки = ДиалогВыбора.Каталог;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ВыполнитьДействияПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Организация <> ВыбранноеЗначение И Объект.ОбъектыОбмена.Количество() > 0 Тогда 
		
		СтандартнаяОбработка = Ложь;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение)),
			НСтр("ru='При изменении организации список объектов обмена будет очищен.
			|Продолжить с очисткой списка объектов?'"), РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, ,КодВозвратаДиалога.Нет);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Объект.Организация = ДополнительныеПараметры.ВыбранноеЗначение;
		Модифицированность = Истина;
		ВыполнитьДействияПриИзмененииОрганизации();
		Объект.ОбъектыОбмена.Очистить();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействияПриИзмененииОрганизации()

	ЗаполнитьЗначенияСвойств(Объект, ПолучитьНастройкиОбменаПоУмолчанию(Объект.Организация, Объект.КассовыйОрган));
	ОпределитьВидимостьКоманд();

КонецПроцедуры // ВыполнитьДействияПриИзмененииОрганизации()
 
&НаКлиенте
Процедура КассовыйОрганОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Тип") И Объект.КассовыйОрган <> ВыбранноеЗначение И Объект.ОбъектыОбмена.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ПараметрыВопроса = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);	      	
	    Оповещение = Новый ОписаниеОповещения("КассовыйОрганОбработкаВыбора_ПослеЗакрытия", ЭтаФорма, ПараметрыВопроса);
		ТекстВопроса = НСтр("ru='При изменении кассового органа список объектов обмена будет очищен.
								|Продолжить с очисткой списка объектов?'");	  
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбменаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Информация" Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Элементы.ОбъектыОбмена.ТекущиеДанные.Описание) 
			И Элементы.ОбъектыОбмена.ТекущиеДанные.Описание <> "Операция успешна!" Тогда
		
			ПараметрыФормыОшибок = Новый Структура("СведенияОбОшибках", Элементы.ОбъектыОбмена.ТекущиеДанные.ОписаниеОшибки);
			ОткрытьФорму("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.Форма.Ошибки", ПараметрыФормыОшибок, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормы.Вставить("Организация", 			Объект.Организация);
	ПараметрыФормы.Вставить("Отбор", 				Новый Структура("Организация", Объект.Организация));
	ПараметрыФормы.Вставить("КассовыйОрган",		Объект.КассовыйОрган);
	ПараметрыФормы.Вставить("ВидОбмена", 			Объект.ВидОбмена);
	ПараметрыФормы.Вставить("НастройкаОбмена", 		Объект.НастройкаОбмена);
	ПараметрыФормы.Вставить("НастройкаФорматов",	Объект.НастройкаФорматов);
	
	ОткрытьФорму("РегистрСведений.НастройкиОбменаБанкиКСПоУмолчанию.ФормаСписка", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтвет(Команда)
	
	Если Модифицированность Тогда
		Попытка
			ЭтаФорма.Записать();
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось записать документ'"));
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	ВыполнитьЗагрузкуВнешнейОбработкой = РеквизитЗагружатьОтветВнешнейОбработкой(Объект.НастройкаОбмена);
	
	Если ВыполнитьЗагрузкуВнешнейОбработкой Тогда
	
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник,Окно,Уникальность",ЭтаФорма,Неопределено,Ложь);
		
		ДополнительныеОтчетыИОбработкиКлиент.ОткрытьФормуКомандДополнительныхОтчетовИОбработок(
			МассивОбъектов,
			ПараметрыВыполненияКоманды,
			ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиСозданиеСвязанныхОбъектов()
		);

	Иначе
	
		ЗаданиеНаИмпорт = ЗагрузитьОтветСервер();
		ПараметрыФормы = Новый Структура("Ключ",ЗаданиеНаИмпорт);
		ОткрытьФорму("Документ.ЗаданиеНаИмпортДанныхБанкиКС.Форма.ФормаДокумента",ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ОчиститьСообщения();
	
	// подготовка к заполнению объектов экспорта
	ЕстьОшибкиВЗаполненииНастроек = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ЕстьОшибкиВЗаполненииНастроек = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Организация>> в настройках обмена'"),, "Объект.Организация");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.НастройкаФорматов) Тогда
		ЕстьОшибкиВЗаполненииНастроек = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Настройка форматов>> в настройках обмена'"),, "Объект.НастройкаФорматов");
	КонецЕсли;

	Если ЕстьОшибкиВЗаполненииНастроек Тогда
		Возврат;
	КонецЕсли;	
		
	Если Объект.ОбъектыОбмена.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр("ru = 'Существующие строки документа будут удалены. 
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;  
	
	//настройка видимости элементов табличной части
	Элементы.ОбъектыОбменаОбъект.Видимость   = Истина;
	Элементы.ОбъектыОбменаОбъект.Доступность = Истина;
	
	Элементы.ОбъектыОбменаФайл.Видимость     = Ложь;
	Элементы.ОбъектыОбменаФайл.Доступность   = Ложь;
    //----------------------------------------------
	
	ЗаполнитьФрагмент();
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗаполнитьФайлами(Команда)  
	
	ОчиститьСообщения();
	
	Если Объект.ОбъектыОбмена.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьФайламиЗавершение", ЭтотОбъект), НСтр("ru = 'Существующие строки документа будут удалены. 
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;  
	
	//настройка видимости элементов табличной части
	Элементы.ОбъектыОбменаОбъект.Видимость   = Ложь;
	Элементы.ОбъектыОбменаОбъект.Доступность = Ложь;
	
	Элементы.ОбъектыОбменаФайл.Видимость     = Истина;
	Элементы.ОбъектыОбменаФайл.Доступность   = Истина;
    //----------------------------------------------
	
	ЗаполнитьФрагментФайлы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФайлы(Команда)
	
	ЭтаФорма.Записать();
	ТекстОшибки = "";
	
	ДополнительныеПараметры = Новый Структура;
	ЭкспортФайловКлиент.ЭкспортФайловЗаданияНаЭкспорт(Объект.Ссылка, Объект.НастройкаОбмена, Объект.КаталогВыгрузки, ТекстОшибки, УникальныйИдентификатор,ДополнительныеПараметры);
	
	ЭтаФорма.Прочитать();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	ТребуетсяСледующаяИтерация = Ложь;	
	Если ДополнительныеПараметры.Свойство("ТребуетсяСледующаяИтерация",ТребуетсяСледующаяИтерация) Тогда
		Если ТребуетсяСледующаяИтерация = Истина Тогда
			 ТекстВопроса = Нстр("ru='Из сервиса получены не все данные. Получить следующие порции?'");
			 ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьИПодготовитьФайлы",ЭтотОбъект);
			 ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса,РежимДиалогаВопрос.ОКОтмена);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьОтветИзСервиса(Команда)
	ТекДанные = Элементы.ОбъектыОбмена.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Модифицированность Тогда
			ЭтаФорма.Записать();
		КонецЕсли;
		ТекИдентификатор = ТекДанные.НомерСтроки-1;
		ТекстовыйДокумент = ПолучитьТекстовыйДокументСОтветом(ТекИдентификатор);
		ТекстовыйДокумент.Показать(НСтр("ru='Ответ из web-сервиса, полученный при отправке файла """+ТекДанные.ИмяФайлаВыгрузки+"""'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьПротоколОбмена(Команда)
	ТекДанные = Элементы.ОбъектыОбмена.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Модифицированность Тогда
			ЭтаФорма.Записать();
		КонецЕсли;
		ТекИдентификатор = ТекДанные.НомерСтроки-1;
		ТекстПротокола = ПолучитьТекстПротокола(ТекИдентификатор);

		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ТекстПротокола);
		ТекстовыйДокумент.Показать("Протокол");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если РеквизитыЗаполненыКорректно() Тогда
		ЗаписатьНастройкиПоУмолчанию();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлыЭкспорта(Команда)
	
	ОчиститьСообщения();	
	
	Если Объект.Проведен Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтменитьПроведениеИСформироватьФайлыЭкспорта", ЭтотОбъект, Новый Структура("Команда", Команда)), НСтр("ru = 'Нельзя формировать файлы для проведенного документа!
		                  |         Отменить проведение документа?'"), РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
        Возврат;
	
    КонецЕсли;
	
	СформироватьФайлыЭкспортаФрагмент(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период",Новый СтандартныйПериод(Объект.ДатаНач, Объект.ДатаКон));
	ПараметрыФормы.Вставить("Организация",Объект.Организация);
	ПараметрыФормы.Вставить("НастройкаФорматов",Объект.НастройкаФорматов);
	ПараметрыФормы.Вставить("УИД",УникальныйИдентификатор);
	ПараметрыФормы.Вставить("АдресТаблицыОтбора",АдресНастроекОтбора);
	
	РезультатВыбора = Неопределено;

	
	ОткрытьФорму("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ПодписатьПервыйЭтап(Команда)  
	
	ПараметрыФормыПодписания = Новый Структура("НомерЭтапа, ВидОбмена, Задание", 1, Объект.ВидОбмена, Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.Форма.ПодписьУФЭБС", ПараметрыФормыПодписания, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьВторойЭтап(Команда)
	
	ПараметрыФормыПодписания = Новый Структура("НомерЭтапа, ВидОбмена, Задание", 2, Объект.ВидОбмена, Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.Форма.ПодписьУФЭБС", ПараметрыФормыПодписания, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоходНаСерверДляПерерисовкиФормы()
	//Для Вебклиента	
КонецПроцедуры 

&НаСервере
Функция ПредставлениеВНомереВерссии()
	
	Если ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
		Возврат Объект.ВидОбмена.ПредставлениеВНомереВерсии;
	КонецЕсли; 
	
	Возврат "";   
	
КонецФункции	

&НаКлиенте
Процедура ОпределитьВидимостьКоманд()
	
	Если Объект.ОбъектыОбмена.Количество() > 0 Тогда
		
	    Элементы.СформироватьФайлы.Доступность    = Истина И НЕ ЭтаФорма.ТолькоПросмотр;
		 
		МассивФайлов 	= ЭкспортФайлов.ПолучитьПрикрепленныеФайлыЗаданияНаЭкспорт(Объект.Ссылка);
		Если МассивФайлов.Количество() > 0 Тогда	
			 Элементы.ОтправитьФайлы.Доступность  = Истина И НЕ ЭтаФорма.ТолькоПросмотр;
			 Элементы.ЗагрузитьОтвет.Доступность  = Истина И НЕ ЭтаФорма.ТолькоПросмотр;
		Иначе
			 Элементы.ОтправитьФайлы.Доступность  = Ложь;
			 Элементы.ЗагрузитьОтвет.Доступность  = Ложь;
		КонецЕсли; 
		 
	Иначе	
	     Элементы.СформироватьФайлы.Доступность   = Ложь;
		 Элементы.ОтправитьФайлы.Доступность      = Ложь;
		 Элементы.ЗагрузитьОтвет.Доступность  	  = Ложь;
	КонецЕсли;  
	 
	#Если ВебКлиент Тогда
	//выгрузка файлов нужна только для уфэбс и без веба
	Элементы.Подписать.Видимость            = Ложь;
	Элементы.Подписать.Доступность          = Ложь;	 
	
	Элементы.ЗаполнитьФайлами.Видимость     = Ложь;  
	Элементы.ЗаполнитьФайлами.Доступность   = Ложь; 
	
	//настройка видимости элементов табличной части
	Элементы.ОбъектыОбменаОбъект.Видимость   = Истина;
	Элементы.ОбъектыОбменаОбъект.Доступность = Истина;
	
	Элементы.ОбъектыОбменаФайл.Видимость     = Ложь;
	Элементы.ОбъектыОбменаФайл.Доступность   = Ложь;
	
	#Иначе
	ТекНомерВерсии = ПредставлениеВНомереВерссии();
	Элементы.Подписать.Видимость             = ?(ТекНомерВерсии = "UFBS", Истина, Ложь);
	Элементы.Подписать.Доступность           = ?(ТекНомерВерсии = "UFBS", Истина, Ложь);  
	
	Элементы.ЗаполнитьФайлами.Видимость      = ?(ТекНомерВерсии = "UFBS", Истина, Ложь);  
	Элементы.ЗаполнитьФайлами.Доступность    = ?(ТекНомерВерсии = "UFBS", Истина, Ложь); 
	
	ВидимостьФайла                           = Ложь;
	
	Если ТекНомерВерсии = "UFBS" И Объект.ОбъектыОбмена.Количество()>0 Тогда
		Если ЗначениеЗаполнено(Объект.ОбъектыОбмена[0].Файл) Тогда    
			 ВидимостьФайла                  = Истина;
		КонецЕсли;	
	КонецЕсли; 
	
	//настройка видимости элементов табличной части
	Элементы.ОбъектыОбменаОбъект.Видимость   = НЕ ВидимостьФайла;
	Элементы.ОбъектыОбменаОбъект.Доступность = НЕ ВидимостьФайла;
	
	Элементы.ОбъектыОбменаФайл.Видимость     = ВидимостьФайла;
	Элементы.ОбъектыОбменаФайл.Доступность   = ВидимостьФайла;
	
	#КонецЕсли
		
КонецПроцедуры           
 
&НаКлиенте
Процедура ОбновитьНадписи()
				
	Элементы.ОбъектыОбмена.КоманднаяПанель.ПодчиненныеЭлементы.Заполнить.Заголовок = "Заполнить объектами за период: с " + Формат(Объект.ДатаНач, "ДФ=dd.MM.yy") + 
															" по " + Формат(Объект.ДатаКон, "ДФ=dd.MM.yy");
	#Если ВебКлиент Тогда
		//Нужно пойти на сервер для перересовки формы
		ПоходНаСерверДляПерерисовкиФормы();
	#КонецЕсли	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТабличнойЧастиСервер()
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекОтбора) Тогда
		ТаблицаДопНастроек = ПолучитьИзВременногоХранилища(АдресНастроекОтбора);
	Иначе
		ТаблицаДопНастроек = Неопределено;
    КонецЕсли;
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТабличнуюЧастьОбъектыОбмена(ТаблицаДопНастроек);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведение()

	ЗаданиеНаЭкспорт = РеквизитФормыВЗначение("Объект");	
	Попытка
		ЗаданиеНаЭкспорт.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось отменить проведение документа'"));
		Возврат;
	КонецПопытки;
	ЗначениеВРеквизитФормы(ЗаданиеНаЭкспорт, "Объект");	

КонецПроцедуры

&НаСервере
Процедура ФормированиеФайловЭкспорта()
	
	ЗаданиеНаЭкспорт = РеквизитФормыВЗначение("Объект");
	Если Элементы.ПараметрыИмениФайла.ПодчиненныеЭлементы.Количество()>0 Тогда
		Для Каждого СтрокаТЧ Из ЗаданиеНаЭкспорт.ПроизвольныеПараметры Цикл
			Значение = "";
			Попытка 
				Значение = ЭтаФорма["ПолеТЧ"+СтрокаТЧ.НомерСтроки];
			Исключение
				Значение = "";
			КонецПопытки;
			СтрокаТЧ.Значение = Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаданиеНаЭкспорт.Ссылка.Пустая() Тогда
		Попытка
			ЗаданиеНаЭкспорт.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось записать документ'"));
			Возврат;
		КонецПопытки;	
	КонецЕсли;	
	
	
	ЗаданиеНаЭкспорт.УдалитьВсеПодчиненныйФайлы();
	//-------------------------------------------------
	

	ОбработкаОбмена = Справочники.ТипыОбменаБанкиКС.ПолучитьОбработку(ЗаданиеНаЭкспорт.ВидОбмена);
	Если ОбработкаОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	//-------------------------------------------------
	//преобразование сведений об ошибках  
	
	ОбработкаОбмена.СформироватьФайлы(ЗаданиеНаЭкспорт);
		
	Для каждого СтрокаВыгрузки Из ЗаданиеНаЭкспорт.ОбъектыОбмена Цикл
		
		Если ЗначениеЗаполнено(СтрокаВыгрузки.ОписаниеОшибки) Тогда
			 СтрокаВыгрузки.Описание 	= "Подробно...";			 
		Иначе
			 СтрокаВыгрузки.Описание = "";
		КонецЕсли; 
		 
	КонецЦикла;
	Попытка
		ЗаданиеНаЭкспорт.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось записать документ'"));
		Возврат;
	КонецПопытки;
	ЗначениеВРеквизитФормы(ЗаданиеНаЭкспорт, "Объект");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОбменаИзТабличнойЧасти(Формат)

	Возврат Формат.Владелец;

КонецФункции // ПолучитьВидОбменаИзТабличнойЧасти()
 
&НаСервереБезКонтекста
Функция ПолучитьНастройкиОбменаПоУмолчанию(Организация, КассовыйОрган = Неопределено)
	
	Возврат РегистрыСведений.НастройкиОбменаБанкиКСПоУмолчанию.ПолучитьОсновнуюНастройкуОбменаОрганизации(Организация, КассовыйОрган);
	
КонецФункции	

&НаСервере
Процедура УстановитьВидимостьЕдиногоФайла()
	ЗначениеЕФ = Ложь;
	
	Для Каждого СтрТЧ ИЗ Объект.ВидОбмена.ИмяФайлаПередачи Цикл
		Если Найти(НРег(СтрТЧ.Значение),НРег("ИмяЕдиногоФайла"))>0 Тогда
			ЗначениеЕФ = Истина;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Элементы.ИмяЕдиногоФайла.Видимость = ЗначениеЕФ;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЗагрузитьОтвет()
	
	ВыгрузкаЧерезWebСервис = Объект.НастройкаОбмена.СпособОбмена = Перечисления.СпособыВыгрузкиФайловПередачи.WebСервис;
	Элементы.ЗагрузитьОтвет.Видимость = ВыгрузкаЧерезWebСервис;
	Массив = Новый Массив;
	Массив.Добавить("ИмяОбщегоМодуляОбработки");
	ДанныеПараметров = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПолучитьПараметрыНастройкиОбмена(Массив,Объект.НастройкаОбмена);
	ИмяОбщегоМодуляОбработки = ДанныеПараметров.Получить("ИмяОбщегоМодуляОбработки");

КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияНаСервере(ПерезаполнятьПроизвольныеПараметры = Ложь)
	
	ЭтоКаталог = (Объект.НастройкаОбмена.СпособОбмена = Перечисления.СпособыВыгрузкиФайловПередачи.Каталог);
	
	Элементы.КаталогВыгрузки.Видимость = ЭтоКаталог;
	Если ЭтоКаталог И ПерезаполнятьПроизвольныеПараметры Тогда
		Объект.КаталогВыгрузки = Объект.НастройкаОбмена.ПутьВыгрузкиПоУмолчанию;
	КонецЕсли;
	
	УстановитьВидимостьЕдиногоФайла();
	Если ПерезаполнятьПроизвольныеПараметры Тогда
		Объект.ПроизвольныеПараметры.Очистить();
		Если ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
			Для Каждого ДопПараметр Из Объект.ВидОбмена.ИмяФайлаПередачи Цикл
						
				Если (Найти(Нрег(ДопПараметр.Значение), "задает")   > 0) И
					 (Найти(Нрег(ДопПараметр.Значение), "пользоват") > 0) И
					 (Найти(Нрег(ДопПараметр.Значение), "все")       > 0) Тогда
					
					Строка       = Объект.ПроизвольныеПараметры.Добавить();
					Строка.Имя   = ДопПараметр.ИмяПараметра;
					Строка.Длина = ДопПараметр.ДлинаПараметра;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	СформироватьДополнительныеРеквизиты();
	УстановитьВидимостьЗагрузитьОтвет();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбъектыОбмена()
	
	Если Объект.ОбъектыОбмена.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
			
			Если ПолучитьВидОбменаИзТабличнойЧасти(Объект.ОбъектыОбмена[0].Формат) <> Объект.ВидОбмена Тогда		
				Объект.ОбъектыОбмена.Очистить();		
			КонецЕсли; 
			
		Иначе		
			Объект.ОбъектыОбмена.Очистить();		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДополнительныеРеквизиты()
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого ДопЭлемент Из Элементы.ПараметрыИмениФайла.ПодчиненныеЭлементы Цикл
		УдаляемыеРеквизиты.Добавить(ДопЭлемент.ПутьКДанным);	
	КонецЦикла;
	Результат = Новый ДеревоЗначений;
	
	// общие для группы и элемента
	
	Результат.Колонки.Добавить("ИмяДляФормулы");  
	Результат.Колонки.Добавить("Заголовок");
	Результат.Колонки.Добавить("РастягиватьПоГоризонтали");
	Результат.Колонки.Добавить("ТипЭлемента");
	Результат.Колонки.Добавить("ВидЭлемента");
	
	// реквизиты элемента
	Результат.Колонки.Добавить("ТипЗначения");
	Результат.Колонки.Добавить("Реквизит");
	Результат.Колонки.Добавить("ПоложениеЗаголовка");
	Результат.Колонки.Добавить("ШиринаЭлемента");				

	ОписаниеБулевого = Новый ОписаниеТипов("Булево");
	Для Каждого СтрокаТЧ Из Объект.ПроизвольныеПараметры Цикл
		СтрокаДерева = Результат.Строки.Добавить();
	
		СтрокаДерева.ИмяДляФормулы = "ПолеТЧ"+СтрокаТЧ.НомерСтроки;
		СтрокаДерева.Заголовок   = СтрокаТЧ.Имя;
		СтрокаДерева.ТипЭлемента = Тип("ПолеФормы");
		СтрокаДерева.РастягиватьПоГоризонтали =	Ложь;
		СтрокаДерева.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		СтрокаДерева.ВидЭлемента = ВидПоляФормы.ПолеВвода;
		СтрокаДерева.ШиринаЭлемента = 0;
										 
		СтрокаДерева.ТипЗначения = Тип("Строка");
		СтрокаДерева.Реквизит =	"ПолеТЧ"+СтрокаТЧ.НомерСтроки;
		СтрокаДерева.ПоложениеЗаголовка =	ПоложениеЗаголовкаЭлементаФормы.Авто;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолеТЧ"+СтрокаТЧ.НомерСтроки,
														Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(СтрокаТЧ.Длина)),
													    "",
													  СтрокаТЧ.Имя,
													  Ложь));

	КонецЦикла;	
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты,УдаляемыеРеквизиты);
	
	ДобавитьЭлементыНаФорму(Результат.Строки);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыНаФорму(ДеревоРеквизитов)
	ПолеДляРеквизитов = Элементы.ПараметрыИмениФайла;
    ПрефиксЭлементовОперации = "Доп_";
    Для каждого НовыйРеквизит Из ДеревоРеквизитов Цикл
    	НовЭлемент = ЭтаФорма.Элементы.Найти(ПрефиксЭлементовОперации+НовыйРеквизит.ИмяДляФормулы);
    	Если НовЭлемент = Неопределено Тогда
    		НовЭлемент = ЭтаФорма.Элементы.Добавить(ПрефиксЭлементовОперации+НовыйРеквизит.ИмяДляФормулы,
    											 Тип("ПолеФормы"),
    											 ПолеДляРеквизитов);
    		НовЭлемент.ПутьКДанным = ""+НовыйРеквизит.ИмяДляФормулы;
    	КонецЕсли;
    	
		НовЭлемент.Заголовок = НовыйРеквизит.Заголовок;
		НовЭлемент.Вид = НовыйРеквизит.ВидЭлемента;
		НовЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		НовЭлемент.ЦветФона = Новый Цвет(225,225,225);
		//НовЭлемент.УстановитьДействие("ПриИзменении","Подключаемый_ПриИзмененииДопРеквизита");
		Если НовыйРеквизит.ВидЭлемента = ВидПоляФормы.ПолеВвода Тогда

			НовЭлемент.РастягиватьПоГоризонтали = НовыйРеквизит.РастягиватьПоГоризонтали;
			НовЭлемент.Ширина	= НовыйРеквизит.ШиринаЭлемента;
		КонецЕсли;
    	НовЭлемент.ТолькоПросмотр = Ложь;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Объект.ПроизвольныеПараметры Цикл
		ЭтаФорма["ПолеТЧ"+СтрокаТЧ.НомерСтроки] = СтрокаТЧ.Значение;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КассовыйОрганОбработкаВыбора_ПослеЗакрытия(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбъектыОбмена.Очистить();
	
	Объект.КассовыйОрган = Параметры.ВыбранноеЗначение;
	ЗаполнитьЗначенияСвойств(Объект, ПолучитьНастройкиОбменаПоУмолчанию(Объект.Организация, Объект.КассовыйОрган));
	ОпределитьВидимостьКоманд();
	ВыполнитьДействияНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Функция РеквизитыЗаполненыКорректно()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ВидОбмена) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Вид обмена>>'"),, "ВидОбмена",, Отказ);	
	КонецЕсли; 
			
	Если Не ЗначениеЗаполнено(Объект.НастройкаФорматов) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Настройка форматов>>'"),, "НастройкаФорматов",, Отказ);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.НастройкаОбмена) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить поле <<Настройка обмена>>'"),, "НастройкаОбмена",, Отказ);	
	КонецЕсли;

	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
	
	НастройкиПоУмолчанию = РегистрыСведений.НастройкиОбменаБанкиКСПоУмолчанию.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(НастройкиПоУмолчанию, Объект, "Организация,ВидОбмена,КассовыйОрган");	// заполняем ключ записи
	НастройкиПоУмолчанию.Прочитать();	                                                            // читаем запись чтобы получить реквизит "Основная"
	Если НастройкиПоУмолчанию.Выбран() = Ложь Тогда
		 ЗаполнитьЗначенияСвойств(НастройкиПоУмолчанию, Объект, "Организация,ВидОбмена,КассовыйОрган"); 
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(НастройкиПоУмолчанию, Объект, "НастройкаФорматов,НастройкаОбмена");	// заполняем ресурсы записи	 
		
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		НастройкиПоУмолчанию.Записать();
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибка записи настроек. ""%1""'"), ОписаниеОшибки());			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеВНомереВерсииВидаОбмена(ВидОбмена)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидОбмена, "ПредставлениеВНомереВерсии")

КонецФункции // ПредставлениеВНомереВерсииВидаОбмена()
 
&НаСервереБезКонтекста
Функция РеквизитЗагружатьОтветВнешнейОбработкой(НастройкаОбмена)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаОбмена, "ЗагружатьОтветСервисаВнешнейОбработкой");

КонецФункции

&НаСервереБезКонтекста
Функция ТипКассовогоОрганаВидаОбмена(ВидОбмена)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидОбмена, "ТипКассовогоОргана");

КонецФункции

&НаКлиенте
Процедура УстановитьПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    РезультатВыбора = Результат;
    
    Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
        Объект.ДатаНач = РезультатВыбора.ДатаНачала;
        Объект.ДатаКон = РезультатВыбора.ДатаОкончания;
        АдресНастроекОтбора = РезультатВыбора.АдресТаблицыОтбора;
    КонецЕсли;
    
	ОбновитьНадписи();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ      = РезультатВопроса;
    Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьФрагмент();

КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьФайламиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ      = РезультатВопроса;
    Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьФрагментФайлы();

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьФрагмент()
    
    ЗаполнениеТабличнойЧастиСервер();
    
    Если Объект.ОбъектыОбмена.Количество() = 0 Тогда    
        
        ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не найдено объектов, соответствующих настройкам обмена'"),, "Настройки");
        Возврат;
        
    КонецЕсли;	
    
    ОпределитьВидимостьКоманд();

КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьФайламиНаСервере()   
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТабличнуюЧастьФайлыОбмена();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьФрагментФайлы()
    
    ЗаполнитьФайламиНаСервере();
    
    Если Объект.ОбъектыОбмена.Количество() = 0 Тогда    
        
        ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не найдено присоединенных файлов *.txt или формата выгрузки файлов!'"),,);
        Возврат;
        
    КонецЕсли;	
    
    ОпределитьВидимостьКоманд();

КонецПроцедуры  

&НаКлиенте
Процедура ОтменитьПроведениеИСформироватьФайлыЭкспорта(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Команда = ДополнительныеПараметры.Команда;
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ОтменитьПроведение();
    Иначе
        Возврат;		
    КонецЕсли;
    
    СформироватьФайлыЭкспортаФрагмент(Команда);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлыЭкспортаФрагмент(Знач Команда)
    
    Перем ИзменятьСтатус, ТекстСообщения;
    
    Если Объект.ОбъектыОбмена.Количество() = 0 Тогда       
        
        ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указан ни один объект экспорта'"),, "Заполнить", "Элементы.ОбъектыОбмена.КоманднаяПанель");
        Возврат;
        
    КонецЕсли; 
    
    ФормированиеФайловЭкспорта(); 
    ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы"));
    ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Файлы, "ВладелецФайла", Объект.Ссылка);
    
    ИзменятьСтатус = Истина;
    ТребуетсяПодготовка = Ложь;
	
	Если ПредставлениеВНомереВерсииВидаОбмена(Объект.ВидОбмена)= "GY" Тогда
		// подготовка по формату 1.16.1
		
		Если ГосУслугиКлиентСервер.НужнаКомпонентаПодписиНаКлиенте() Тогда
			ДопПараметры = Новый Структура("Команда",Команда);
						
			Оповещение = Новый ОписаниеОповещения("ПослеПодключенияКомпоненты_Xades2AddIn", ЭтотОбъект,ДопПараметры);
		    ПараметрыПодключения = ОбщегоНазначенияКлиент.ПараметрыПодключенияКомпоненты();
		    ПараметрыПодключения.ТекстПояснения = НСтр("ru = 'Для установки подписи xml файлов требуется
		                                        |внешняя компонента Xades2AddIn.'");
						
		    ОбщегоНазначенияКлиент.ПодключитьКомпонентуИзМакета(Оповещение, "Xades2AddIn","ОбщийМакет.Компонента_xades", ПараметрыПодключения);
			
			Возврат;
		Иначе
			
			ТребуетсяПодготовка = Истина;
			
			ПерейтиКПодготовкеФайлов(Неопределено, Команда);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ИмяОбщегоМодуляОбработки) Тогда 
		 
		Если ВРег(ИмяОбщегоМодуляОбработки) = ВРег("Госуслуги") Тогда
			КонтекстВыполнения = Новый Структура;
			КонтекстВыполнения.Вставить("Результат",Истина);
			КонтекстВыполнения.Вставить("ЗаданиеНаЭкспортСсылка",Объект.Ссылка);
			КонтекстВыполнения.Вставить("ПродолжитьПослеПодготовки",Новый ОписаниеОповещения("ПослеФормированияФайлов", ЭтотОбъект, Команда,"ПослеФормированияФайловОшибка",ЭтотОбъект)); //Оповещение
			
			
			ТребуетсяПодготовка = Истина;
			
			ГосУслугиКлиент.НачатьПодготовкуКОтправке(КонтекстВыполнения);
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ТребуетсяПодготовка Тогда
    	ПослеФормированияФайлов(Истина,Команда);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияКомпоненты_Xades2AddIn(Результат, ДопПараметры) Экспорт
	
	КомпонентаПодписи = Неопределено;
    Если Результат.Подключено Тогда 
        КомпонентаПодписи = Результат.ПодключаемыйМодуль;    
	Иначе
		
		ТекстОшибки = Результат.ОписаниеОшибки;
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		ПослеФормированияФайлов(Ложь,ДопПараметры.Команда);
		
		Возврат;
		
	КонецЕсли;
	
	Если КомпонентаПодписи = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не удалось создать компоненту для формирования электронной подписи.'");			
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		ПослеФормированияФайлов(Ложь,ДопПараметры.Команда);
		
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоLinuxКлиент() Тогда
		Если ЗначениеЗаполнено(ПутьКПрограмме) Тогда
			КомпонентаПодписи.Криптопровайдер = ПутьКПрограмме;
		Иначе
			ПерсональныеНастройки = ЭлектроннаяПодписьКлиент.ПерсональныеНастройки();
			
			ДополнительныеПараметры = Новый Структура("СоответствиеПутей",ПерсональныеНастройки.ПутиКПрограммамЭлектроннойПодписиИШифрования);
			ДополнительныеПараметры.Вставить("Команда",ДопПараметры.Команда);
			ДополнительныеПараметры.Вставить("КомпонентаПодписи",КомпонентаПодписи);
			
			ПослеСозданияМК(Неопределено,ДополнительныеПараметры);
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	ПерейтиКПодготовкеФайлов(КомпонентаПодписи,ДопПараметры.Команда);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияМК(Результат,ДопПараметры)Экспорт
	Если Результат = Неопределено Тогда
		Если ДопПараметры.Свойство("ТекущаяПрограмма") Тогда
			ДопПараметры.СоответствиеПутей.Удалить(ДопПараметры.ТекущаяПрограмма);
		КонецЕсли;
		Для Каждого КлючИЗначение Из ДопПараметры.СоответствиеПутей Цикл
			ДопПараметры.Вставить("ТекущаяПрограмма",КлючИЗначение.Ключ);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияМК",ЭтотОбъект,ДопПараметры);
			ЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(ОписаниеОповещения,"",Ложь,КлючИЗначение.Ключ);
			Возврат;
		КонецЦикла;
	Иначе
		Результат = Неопределено;
		ПутьКПрограмме = ДопПараметры.СоответствиеПутей[ДопПараметры.ТекущаяПрограмма];
		ДопПараметры.КомпонентаПодписи.Криптопровайдер = ПутьКПрограмме;
	КонецЕсли;
	
	ПерейтиКПодготовкеФайлов(ДопПараметры.КомпонентаПодписи,ДопПараметры.Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодготовкеФайлов(КомпонентаПодписи,Знач Команда)
	
	КонтекстВыполнения = Новый Структура;
	КонтекстВыполнения.Вставить("Результат",Истина);
	КонтекстВыполнения.Вставить("ЗаданиеНаЭкспортСсылка",Объект.Ссылка);
	КонтекстВыполнения.Вставить("ПродолжитьПослеПодготовки", Новый ОписаниеОповещения("ПослеФормированияФайлов", ЭтотОбъект, Команда,"ПослеФормированияФайловОшибка",ЭтотОбъект)); //Оповещение
	КонтекстВыполнения.Вставить("Версия",1.16); // если не задана, то устанавливается 1.15
	КонтекстВыполнения.Вставить("КомпонентаПодписи",КомпонентаПодписи);
	
	ГосУслугиКлиент.НачатьПодготовкуКОтправке(КонтекстВыполнения);
			
КонецПроцедуры


&НаКлиенте
Процедура ПослеФормированияФайлов(Результат,Команда) Экспорт
	
	ЭтаФорма.Прочитать();
	ИзменятьСтатус = Результат;
	
	Если НЕ ИзменятьСтатус Тогда
        УдалитьПодчиненныеФайлы();
        ТекстСообщения = НСтр("ru='Не удалось подготовить файлы к отправке!'");
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
	Оповестить("Запись_ЗаданиеНаЭкспортДанныхВБанкиКС", , Объект.Ссылка);
    
    ОпределитьВидимостьКоманд();
    
    Если Элементы.ОтправитьФайлы.Доступность  = Истина И НЕ ЭтаФорма.ТолькоПросмотр Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьФайлыЭкспортаЗавершение", ЭтотОбъект, Новый Структура("Команда", Команда));
		
        ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'В ходе выгрузки были сформированы файлы передачи. 
        |               Отправить файлы?'"), РежимДиалогаВопрос.ДаНет);
        
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияФайловОшибка(ИнформацияОбОшибке,СтандартнаяОбработка,ДопПараметр) Экспорт
	
	ЭтаФорма.Прочитать();
	СтандартнаяОбработка = Ложь;
	
	ТекстСообщения = НСтр("ru='"+ИнформацияОбОшибке.Описание+"'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	УдалитьПодчиненныеФайлы();
    ТекстСообщения = НСтр("ru='Не удалось подготовить файлы к отправке!'");
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	ОпределитьВидимостьКоманд();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлыЭкспортаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Команда = ДополнительныеПараметры.Команда;
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ОтправитьФайлы(Команда);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьИПодготовитьФайлы(РезультатОтвета,ДопольнительныеПараметры) Экспорт
	Если РезультатОтвета<> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ГосУслугиКлиент.ПолучитьСледующуюПорциюДанных(Объект.Ссылка,Объект.НастройкаОбмена,ЭтотОбъект.УникальныйИдентификатор);
	ЭтаФорма.Прочитать();	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьОтветСервер()
	Возврат Документы.ЗаданиеНаИмпортДанныхБанкиКС.СформироватьЗаданиеНаИмпорт(Объект.Ссылка,ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура УдалитьПодчиненныеФайлы()
	Задание = РеквизитФормыВЗначение("Объект");
	Задание.УдалитьВсеПодчиненныйФайлы();
	ЗначениеВРеквизитФормы(Задание,"Объект");
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстовыйДокументСОтветом(ИндексСтроки)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ОтветИзСервиса = ТекОбъект.ОбъектыОбмена[ИндексСтроки].ОтветWebСервиса.Получить();
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ОтветИзСервиса);
	Возврат ТекстовыйДокумент;
		
КонецФункции

&НаСервере
Функция ПолучитьТекстПротокола(ИндексСтроки)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	СтрокаТЧ = ТекОбъект.ОбъектыОбмена[ИндексСтроки];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Файлы.Ссылка КАК ФайлЗапроса,
				   |	Файлы.Наименование + ""."" + Файлы.Расширение КАК ИмяФайла
	               |ИЗ
	               |	Справочник.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы КАК Файлы
	               |ГДЕ
	               |	Файлы.ВладелецФайла = &Ссылка
	               |	И Файлы.Наименование + ""."" + Файлы.Расширение = &ИмяФайлаВыгрузки";
	Запрос.УстановитьПараметр("Ссылка", ТекОбъект.Ссылка);
	Запрос.УстановитьПараметр("ИмяФайлаВыгрузки", СтрокаТЧ.ИмяФайлаВыгрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();			   
	
	Если Выборка.Следующий() Тогда
		
		ОтветИзСервиса = СтрокаТЧ.ОтветWebСервиса.Получить();
		Возврат СформироватьТекстПротокола(Выборка,ОтветИзСервиса);
						
	Иначе
		
		ОтветИзСервиса = ЭкспортФайлов.РазобратьОтветИзСервиса(СтрокаТЧ.ОтветWebСервиса);			

	    Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
           |	Файлы.Ссылка КАК ФайлЗапроса,
		   |	Файлы.Наименование + ""."" + Файлы.Расширение КАК ИмяФайла
           |ИЗ
           |	Справочник.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы КАК Файлы
           |ГДЕ
           |	Файлы.ВладелецФайла = &Ссылка
           |	И Файлы.Наименование + ""."" + Файлы.Расширение В (&МассивИменФайлов)";
				   
		Запрос.УстановитьПараметр("Ссылка", ТекОбъект.Ссылка);
		МассивИменФайлов = ОтветИзСервиса.ВыгрузитьКолонку("ИмяФайла");
		Запрос.УстановитьПараметр("МассивИменФайлов", МассивИменФайлов);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Результат = "";
		Для Каждого СтрТЧ Из ОтветИзСервиса Цикл
			Если ЗначениеЗаполнено(СтрТЧ.ИмяФайла) Тогда
				Выборка.Сбросить();
				Если Выборка.НайтиСледующий(Новый Структура("ИмяФайла",СтрТЧ.ИмяФайла)) Тогда
					Результат = Результат + СформироватьТекстПротокола(Выборка,СтрТЧ.Ответ);
					Результат = Результат + "
					|
					|////////////////////////////////////////////////////////////////////////////////
					|"
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьТекстПротокола(СтрокаВыборки,Ответ)
	
	Если ЗначениеЗаполнено(СтрокаВыборки.ФайлЗапроса) Тогда
		ДвочныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(СтрокаВыборки.ФайлЗапроса);
		ВременныйФайл = ПолучитьИмяВременногоФайла();
		ДвочныеДанные.Записать(ВременныйФайл);
		ДвочныеДанные = Неопределено;
		
		ЧтениеТекста = Новый ЧтениеТекста(ВременныйФайл);
		ТекстЗапроса = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();		
		ЧтениеТекста = Неопределено;
		
		УдалитьФайлы(ВременныйФайл);
	Иначе
		ТекстЗапроса = "";
	КонецЕсли;
	
	Результат = "
				|Файл: " + СтрокаВыборки.ИмяФайла + "
				|
				|" + ТекстЗапроса + "
				|
				|////////////////////////////////////////////////////////////////////////////////
				|
				|Ответ web-сервиса:
				|
				|" + Ответ;
	
	Возврат Результат;
	
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПользовательскуюНастройку(КомпоновщикНастроекКомпоновкиДанных, ПользовательскиеНастройки, ИмяНастройки, Настройка)   
    ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяНастройки);
    ЭлементОтбора = Неопределено;   
    Для Каждого Элемент Из КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.Элементы Цикл
        Если Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
            ЭлементОтбора = Элемент;
            Прервать;
        КонецЕсли;
    КонецЦикла;   
    Если ЭлементОтбора = Неопределено Тогда       
        Для каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл       
            Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда           
                ЭлементОтбора = Элемент.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
                ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
                ЭлементОтбора.ВидСравнения = Настройка.ВидСравнения;
                ЭлементОтбора.Использование = Настройка.Использование;
                ЭлементОтбора.ПравоеЗначение = Настройка.ПравоеЗначение;          
            КонецЕсли;     
        КонецЦикла;            
    Иначе       
        Элемент = ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);      
        Элемент.ВидСравнения     = Настройка.ВидСравнения;
        Элемент.ПравоеЗначение   = Настройка.ПравоеЗначение;
        Элемент.Использование    = Настройка.Использование;       
    КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРеестр(Команда)
	
	Форма                               = ПолучитьФорму("Отчет.РеестрВыгруженныхЭлектронныхДокументов.Форма");   
	
    КомпоновщикНастроекКомпоновкиДанных = Форма.Отчет.КомпоновщикНастроек;
    ПользовательскиеНастройки           = КомпоновщикНастроекКомпоновкиДанных.ПользовательскиеНастройки; 
	
    Настройка                    = Новый Структура;
    Настройка.Вставить("ВидСравнения",ВидСравненияКомпоновкиДанных.Равно);
    Настройка.Вставить("ПравоеЗначение", Объект.Ссылка);
    Настройка.Вставить("Использование", Истина);   
    УстановитьПользовательскуюНастройку(КомпоновщикНастроекКомпоновкиДанных,
        ПользовательскиеНастройки,
        "Задание",
        Настройка);     
		
	Настройка                    = Новый Структура;
    Настройка.Вставить("ВидСравнения",ВидСравненияКомпоновкиДанных.Равно);
    Настройка.Вставить("ПравоеЗначение", Объект.Организация);
    Настройка.Вставить("Использование", Истина);   
    УстановитьПользовательскуюНастройку(КомпоновщикНастроекКомпоновкиДанных,
        ПользовательскиеНастройки,
        "Организация",
        Настройка); 
		
	Настройка                    = Новый Структура;
    Настройка.Вставить("ВидСравнения",ВидСравненияКомпоновкиДанных.Равно);
    Настройка.Вставить("ПравоеЗначение", Объект.ВидОбмена);
    Настройка.Вставить("Использование", Истина);   
    УстановитьПользовательскуюНастройку(КомпоновщикНастроекКомпоновкиДанных,
        ПользовательскиеНастройки,
        "ТипФормата",
        Настройка);    		
		
    ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, ПользовательскиеНастройки",
        Истина,
        ПользовательскиеНастройки); 
		
    ОткрытьФорму("Отчет.РеестрВыгруженныхЭлектронныхДокументов.Форма", ПараметрыФормы);   	
	
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры

// Конец ИнтеграцияС1САрхивом

#КонецОбласти
